Revit 2024 API
SpotDimension.CanFlip Method
 Verifies that the direction of the dimension can be flipped.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.2
Syntax
C#
public bool CanFlip()
Visual Basic
Public Function CanFlip As Boolean
Visual C++
public:
bool CanFlip()
Return Value
 True if the element can be flipped, false otherwise.
Remarks
 Currently, flipping only allowed for non-pinned AlignmentStationLabels.
See Also
SpotDimension Class
Autodesk.Revit.DB Namespace